### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd

In [11]:
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [12]:
a = list(range(1 , 11))
pd.Series(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [15]:
d = {
    'Name' : ["Alice" , "bob" , "Claire"],
    'Age' : [25 , 30 , 27],
    'Gender' : ["female" , "Male" ,"Female"]
}
pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  female
1     bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrames in pandas is a two-dimensional table and it is labelled with rows and columns. It is use in python for manipulation and analysis of the data .  A  DataFrames can also be thought as a collection of a Series.


The differnece between DataFrame and a Series is that  DataFrames can have multiple columns of different types While series can only have one column of a single type .

In [25]:
data = pd.Series({
    "name": ["Alice", "Bob", "Charlie" ,"David"],
    "age": [25, 30, 35, 40], 
    "gender": ["F", "M", "M", "M"], 
    "salary": [5000, 6000, 7000, 8000] 
})

In [26]:
data

name      [Alice, Bob, Charlie, David]
age                   [25, 30, 35, 40]
gender                    [F, M, M, M]
salary        [5000, 6000, 7000, 8000]
dtype: object

In [28]:
data1 = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie" ,"David"],
    "age": [25, 30, 35, 40], 
    "gender": ["F", "M", "M", "M"], 
    "salary": [5000, 6000, 7000, 8000] 
})

In [29]:
data1

      name  age gender  salary
0    Alice   25      F    5000
1      Bob   30      M    6000
2  Charlie   35      M    7000
3    David   40      M    8000

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

sort_values() :  Thisw function sorts the rows of a  DataFrame by one or more columns in ascending or descending values . Ity is used to arrenge the data according to the given condition

isnull() : this function is used to check and identify the missing or values in a DataFrame or a series . It return a boolean object that indicates whether each element is null or not.

describe() : This function returns a summary of statistic for each columns ina a DataFrame  , such as median  , mean , standard deviation , mode , minimum , maximum and Quartile .

In [32]:
data1.describe()

             age       salary
count   4.000000     4.000000
mean   32.500000  6500.000000
std     6.454972  1290.994449
min    25.000000  5000.000000
25%    28.750000  5750.000000
50%    32.500000  6500.000000
75%    36.250000  7250.000000
max    40.000000  8000.000000

In [39]:
data1.isnull()

    name    age  gender  salary
0  False  False   False   False
1  False  False   False   False
2  False  False   False   False
3  False  False   False   False

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A Dataframe ia a two dimensionl data structure that can store and manipulate data in tabular format which means it has rows and columns .  A DataFrames is both value amd size-mutable , whaich means that value nd the dimension of the DataFrame can be changed 


A Series is one-dimensional data structure that can store the data of a single type along with an index . In Series it value can be changed but not size which means it leng doesn't changed but its can value changed.


In Panel it has  three-dimensional data structure and size mutable array

### Q7 Create a DataFrame using multiple Series. Explain with an example.

In [47]:
Actor = pd.Series([
    'Ram Charan',
    'Allu Arjun',
    'Vijay Devarkonda',
    'Nikhil Akkikheni'
])


Film  = pd.Series([
    'RRR',
    'Pushpa',
    'Dear Comrade',
    'Mr Majnu'
])


Ratings = pd.Series([
    9.2,
    9.0,
    8.3,
    8.5
])

In [48]:
Hit_Movies = pd.DataFrame({
    'Hero' : Actor,
    'BlockBusters' : Film,
    'Imdb' : Ratings
})

In [49]:
Hit_Movies

               Hero  BlockBusters  Imdb
0        Ram Charan           RRR   9.2
1        Allu Arjun        Pushpa   9.0
2  Vijay Devarkonda  Dear Comrade   8.3
3  Nikhil Akkikheni      Mr Majnu   8.5